# 09: SQL
- Author: AgustÃ­n Arturo Melian Su
- Date: 25/08/2025
- Goal: Learn how to connect and create a database

In [1]:
from pandasql import sqldf
import os
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/syntagmatic/gapminder-csv/refs/heads/master/gapminder.csv"

df = pd.read_csv(url)

df.size

42588933

In [ ]:
sqldf("SELECT * FROM df LIMIT 5")

In [ ]:
sqldf("SELECT geo, time, children_per_woman_total_fertility, life_expectancy_years FROM df WHERE geo='arg' and time > 1975 LIMIT 10")

In [ ]:
sqldf("SELECT geo, time, children_per_woman_total_fertility, life_expectancy_years FROM df WHERE geo IN ('col', 'arg', 'mex') AND time = 2000")

In [ ]:
sqldf("SELECT geo, time, gdp_total_yearly_growth \
FROM df \
WHERE geo='per' \
AND time BETWEEN 1985 AND 2000")

In [ ]:
sqldf("SELECT MAX(gdp_total_yearly_growth) AS max_gdp FROM df WHERE geo='mex'")

In [ ]:
sqldf("SELECT MAX(gdp_total_yearly_growth) \
AS max_gdp, geo \
FROM df GROUP BY geo \
LIMIT 20")

In [ ]:
sqldf("SELECT MAX(gdp_total_yearly_growth) \
AS max_gdp, geo, time \
FROM df \
WHERE geo IN ('arg', 'per', 'mex') \
GROUP BY geo")

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
con = sqlite3.connect('/workspaces/clases-4geeks/datasets/test.df')

In [ ]:
con.execute('CREATE TABLE movies(' \
            'id INT PRIMARY KEY NOT NULL,' \
            'title TEXT,' \
            'year INT NOT NULL)')

In [ ]:
con.execute("INSERT INTO movies VALUES(1, 'Titanic', 1997)")
con.execute("INSERT INTO movies VALUES(2, 'The Godfather', 1972)")
con.execute("INSERT INTO movies VALUES(3, 'Gladiator 2', 2025)")
con.commit()

In [ ]:
cursor = con.execute("SELECT * FROM movies WHERE year > 1990")

In [ ]:
for row in cursor:
  print(f'Title: {row[1]}, year: {row[2]}')

In [ ]:
con.close